app/views/admins/index.html.erb

SELECT "admins".* FROM "admins"
---
        <ul id="listAdmins">
          <% Admin.all.each do |admin| %>