app/views/manage_ideas/index.html.erb

SELECT "topics".* FROM "topics"  ORDER BY "topics"."name" ASC
---
        <%= form_for :idea, url: approve_manage_idea_path(idea), remote: true, method: :post do |f|  %>
        <%= f.collection_select :topic_id, Topic.order(:name),:id, :name, {include_blank: 'Categoria'}, {:class => 'btn btn-default dropdown-toggle', :required =>true} %>