app/controllers/admins_controller.rb

INSERT INTO "admins" ("email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
---
  def create
    @admin = Admin.new(admin_params)

    respond_to do |format|
      if @admin.save