app/controllers/admins_controller.rb

  def create
    if !Admin.where(email: admin_params[:email]).blank?
---
SELECT  1 AS one FROM "admins" WHERE "admins"."email" = 'cenas@cenas.com' LIMIT 1