app/controllers/contacts_controller.rb

  def create
    @contact = Contact.new(contact_params)
    @contact.date = Time.zone.now.to_date
    @contact.seen = false
    if @contact.save
---
INSERT INTO "contacts" ("name", "title", "email", "message", "date", "seen", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"