app/controllers/ideas_controller.rb

  def index
    @ideas = Idea.where(winner: true).order('created_at DESC')
---
SELECT "ideas".* FROM "ideas" WHERE "ideas"."winner" = $1  ORDER BY created_at DESC  [["winner", "t"]]

  def index_en
    @ideas = Idea.where(winner: true).order('created_at DESC')
---
SELECT "ideas".* FROM "ideas" WHERE "ideas"."winner" = $1  ORDER BY created_at DESC  [["winner", "t"]]

  def show
    @idea = Idea.find(params[:id])
---
SELECT  "ideas".* FROM "ideas" WHERE "ideas"."id" = $1 LIMIT 1  [["id", 1]]

  def create
    @idea = Idea.new(idea_params)
    @idea.date = Time.zone.now.to_date
    if @idea.save
---
INSERT INTO "ideas" ("author", "email", "author2", "email2", "author3", "email3", "title", "resumo", "text", "picture", "date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"