app/controllers/ideas_controller.rb

SELECT  "ideas".* FROM "ideas" WHERE "ideas"."id" = $1 LIMIT 1  [["id", 4]]
DELETE FROM "ideas" WHERE "ideas"."id" = $1  [["id", 4]]
---
  def cancel
    @idea = Idea.find(params[:id])
    var = params[:id]
    @idea.destroy