app/controllers/manage_ideas_controller.rb

  def index
    @ideas = Idea.where(winner: false).order('created_at DESC')
---
SELECT "ideas".* FROM "ideas" WHERE "ideas"."winner" = $1  ORDER BY created_at DESC  [["winner", "f"]]

  def approve
    @idea = Idea.find(params[:id])
    @idea.update_attribute(:winner, true)
---
SELECT  "ideas".* FROM "ideas" WHERE "ideas"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "ideas" SET "topic_id" = $1, "updated_at" = $2 WHERE "ideas"."id" = $3  [["topic_id", 1], ["updated_at", "2015-12-04 13:46:14.737916"], ["id", 2]]

  def delete
    @idea = Idea.find(params[:id])
    @idea.destroy
---
SELECT  "ideas".* FROM "ideas" WHERE "ideas"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "ideas" WHERE "ideas"."id" = $1  [["id", 1]]