app/controllers/received_contacts_controller.rb

SELECT "contacts".* FROM "contacts" WHERE "contacts"."seen" = $1  [["seen", "f"]]
---
  def index
     @received_contacts = Contact.where(seen: false)