app/controllers/sessions_controller.rb

 def create
   admin = Admin.find_by_email(params[:email])
---
SELECT  "admins".* FROM "admins" WHERE "admins"."email" = $1 LIMIT 1  [["email", "cenas@cenas.com"]]