app/controllers/top_ideas_controller.rb

  def index
    @ideas = Idea.where(winner: true).order('created_at DESC')
---
SELECT "ideas".* FROM "ideas" WHERE "ideas"."winner" = $1  ORDER BY created_at DESC  [["winner", "t"]]