app/controllers/topics_controller.rb

INSERT INTO "topics" ("name", "picture", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "cenas"], ["picture", "wallpaper.jpg"], ["created_at", "2015-12-04 13:34:10.947420"], ["updated_at", "2015-12-04 13:34:10.947420"]]
---
  def create
    @topic = Topic.new(topic_params)
    if @topic.save