app/controllers/welcome_controller.rb

SELECT COUNT(*) FROM "ideas" WHERE "ideas"."winner" = 't'
SELECT  "ideas".* FROM "ideas" WHERE "ideas"."winner" = $1  ORDER BY created_at DESC LIMIT 5  [["winner", "t"]]
---
  def index
    @has_ideas = Idea.where(winner: true).size
    @counter = 1
    if (@has_ideas != 0)
      @ideas = Idea.where(winner: true).order('created_at DESC').limit(5)

SELECT  "ideas".* FROM "ideas" WHERE "ideas"."winner" = $1  ORDER BY created_at DESC LIMIT 1  [["winner", "t"]]
SELECT COUNT(*) FROM "ideas" WHERE "ideas"."winner" = $1  [["winner", "t"]]
---
  def index_en
    @has_ideas = Idea.where(winner: true).size